app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "part" = ?, "intro" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["part", 4], ["intro", "はじめまして！"], ["updated_at", "2021-01-31 14:27:51.869831"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)